pbaizan/Arduino_package_VISIR_Ionosens_Boards/variants/VISB2560/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define NUM_DIGITAL_PINS            86 // Valor original 70
#define NUM_ANALOG_INPUTS           16 // OK se mantiene
#define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 54 : -1) // Ok se mantiene
#define digitalPinHasPWM(p)         (((p) >= 2 && (p) <= 13) || ((p) >= 44 && (p)<= 46)) // OK se mantiene

#define PIN_SPI_SS    (53) // OK se mantiene
#define PIN_SPI_MOSI  (51) // OK se mantiene
#define PIN_SPI_MISO  (50) // OK se mantiene
#define PIN_SPI_SCK   (52) // OK se mantiene

static const uint8_t SS   = PIN_SPI_SS; // OK se mantiene
static const uint8_t MOSI = PIN_SPI_MOSI; // OK se mantiene
static const uint8_t MISO = PIN_SPI_MISO; // OK se mantiene
static const uint8_t SCK  = PIN_SPI_SCK; // OK se mantiene

#define PIN_WIRE_SDA        (20) // OK se mantiene
#define PIN_WIRE_SCL        (21) // OK se mantiene

static const uint8_t SDA = PIN_WIRE_SDA; // OK se mantiene
static const uint8_t SCL = PIN_WIRE_SCL; // OK se mantiene

#define LED_BUILTIN 30 // Mofificado por el correspondiente al pin DATA

#define PIN_A0   (54) // OK se mantiene
#define PIN_A1   (55) // OK se mantiene
#define PIN_A2   (56) // OK se mantiene
#define PIN_A3   (57) // OK se mantiene
#define PIN_A4   (58) // OK se mantiene
#define PIN_A5   (59) // OK se mantiene
#define PIN_A6   (60) // OK se mantiene
#define PIN_A7   (61) // OK se mantiene
#define PIN_A8   (62) // OK se mantiene
#define PIN_A9   (63) // OK se mantiene
#define PIN_A10  (64) // OK se mantiene
#define PIN_A11  (65) // OK se mantiene
#define PIN_A12  (66) // OK se mantiene
#define PIN_A13  (67) // OK se mantiene
#define PIN_A14  (68) // OK se mantiene
#define PIN_A15  (69) // OK se mantiene

static const uint8_t A0 = PIN_A0; // OK se mantiene
static const uint8_t A1 = PIN_A1; // OK se mantiene
static const uint8_t A2 = PIN_A2; // OK se mantiene
static const uint8_t A3 = PIN_A3; // OK se mantiene
static const uint8_t A4 = PIN_A4; // OK se mantiene
static const uint8_t A5 = PIN_A5; // OK se mantiene
static const uint8_t A6 = PIN_A6; // OK se mantiene
static const uint8_t A7 = PIN_A7; // OK se mantiene
static const uint8_t A8 = PIN_A8; // OK se mantiene
static const uint8_t A9 = PIN_A9; // OK se mantiene
static const uint8_t A10 = PIN_A10; // OK se mantiene
static const uint8_t A11 = PIN_A11; // OK se mantiene
static const uint8_t A12 = PIN_A12; // OK se mantiene
static const uint8_t A13 = PIN_A13; // OK se mantiene
static const uint8_t A14 = PIN_A14; // OK se mantiene
static const uint8_t A15 = PIN_A15; // OK se mantiene

// A majority of the pins are NOT PCINTs, SO BE WARNED (i.e. you cannot use them as receive pins)
// Only pins available for RECEIVE (TRANSMIT can be on any pin):
// (I've deliberately left out pin mapping to the Hardware USARTs - seems senseless to me)
// Pins: 10, 11, 12, 13,  50, 51, 52, 53,  62, 63, 64, 65, 66, 67, 68, 69

#define digitalPinToPCICR(p)    ( (((p) >= 10) && ((p) <= 13)) || \
                                  (((p) >= 50) && ((p) <= 53)) || \
                                  (((p) >= 62) && ((p) <= 69)) ? (&PCICR) : ((uint8_t *)0) ) // OK se mantiene

#define digitalPinToPCICRbit(p) ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? 0 : \
                                ( (((p) >= 62) && ((p) <= 69)) ? 2 : \
                                0 ) ) // OK se mantiene

#define digitalPinToPCMSK(p)    ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? (&PCMSK0) : \
                                ( (((p) >= 62) && ((p) <= 69)) ? (&PCMSK2) : \
                                ((uint8_t *)0) ) ) // OK se mantiene

#define digitalPinToPCMSKbit(p) ( (((p) >= 10) && ((p) <= 13)) ? ((p) - 6) : \
                                ( ((p) == 50) ? 3 : \
                                ( ((p) == 51) ? 2 : \
                                ( ((p) == 52) ? 1 : \
                                ( ((p) == 53) ? 0 : \
                                ( (((p) >= 62) && ((p) <= 69)) ? ((p) - 62) : \
                                0 ) ) ) ) ) ) // OK se mantiene

#define digitalPinToInterrupt(p) ((p) == 2 ? 0 : ((p) == 3 ? 1 : ((p) >= 18 && (p) <= 21 ? 23 - (p) : NOT_AN_INTERRUPT))) // OK se mantiene

#define VISB_RX  (0)
#define VISB_TX  (1)
#define GPIO4    (2)
#define GPIO3    (3)
#define GPIO7 	 (4)
#define GPIO5 	 (5)
#define RELAY3	 (6)
#define RELAY4 	 (7)
#define RELAY5 	 (8)
#define RELAY6	 (9)
#define RELAY7 	 (10)
#define RELAY9	 (11)
#define RELAY8   (12)
#define RELAY10  (13)
#define GPIO39	 (14)
#define GPIO40 	 (15)
#define RELAY12  (16)
#define RELAY13  (17)
#define RELAY20  (18)
#define RELAY21  (19)
#define SDA_BUS  (20)
#define SCL_BUS  (21)
#define GPIO26   (22)
#define GPIO24 	 (23)
#define GPIO25 	 (24)
#define GPIO28 	 (25)
#define GPIO29 	 (26)
#define GPIO30 	 (27)
#define GPIO31 	 (28)
#define GPIO32 	 (29)
#define DATA 	 (30)
#define ALARM 	 (31)
#define GPIO55 	 (32)
#define GPIO54 	 (33)
#define GPIO53 	 (34)
#define GPIO52 	 (35)
#define GPIO51 	 (36)
#define GPIO50 	 (37)
#define RELAY15  (38)
#define GPIO33 	 (39)
#define GPIO49 	 (40)
#define RELAY14  (41)
#define GPIO48 	 (42)
#define GPIO47 	 (43)
#define GPIO46 	 (44)
#define GPIO45 	 (45)
#define GPIO44 	 (46)
#define GPIO43 	 (47)
#define GPIO42 	 (48)
#define GPIO41 	 (49)
#define MISO_BUS (50)
#define MOSI_BUS (51)
#define SCK_BUS  (52)
#define SS_BUS 	 (53)
#define GPIO8 	 (54)
#define GPIO9 	 (55)
#define GPIO10   (56)
#define GPIO11   (57)
#define GPIO12   (58)
#define GPIO13   (59)
#define GPIO14   (60)
#define GPIO15   (61)
#define GPIO16   (62)
#define GPIO17 	 (63)
#define GPIO18   (64)
#define GPIO19   (65)
#define GPIO20   (66)
#define GPIO21   (67)
#define GPIO22   (68)
#define GPIO23 	 (69)
#define GPIO6 	 (70)
#define GPIO2 	 (71)
#define GPIO1    (72)
#define RELAY2   (73)
#define RELAY11  (74)
#define RELAY1   (75)
#define RELAY16  (76)
#define RELAY19  (77)
#define RELAY18  (78)
#define RELAY17  (79)
#define GPIO38 	 (80)
#define GPIO37   (81)
#define GPIO36   (82)
#define GPIO35   (83)
#define GPIO34   (84)
#define GPIO27 	 (85)

#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
	NOT_A_PORT,
	(uint16_t) &DDRA,
	(uint16_t) &DDRB,
	(uint16_t) &DDRC,
	(uint16_t) &DDRD,
	(uint16_t) &DDRE,
	(uint16_t) &DDRF,
	(uint16_t) &DDRG,
	(uint16_t) &DDRH,
	NOT_A_PORT,
	(uint16_t) &DDRJ,
	(uint16_t) &DDRK,
	(uint16_t) &DDRL,
};

const uint16_t PROGMEM port_to_output_PGM[] = {
	NOT_A_PORT,
	(uint16_t) &PORTA,
	(uint16_t) &PORTB,
	(uint16_t) &PORTC,
	(uint16_t) &PORTD,
	(uint16_t) &PORTE,
	(uint16_t) &PORTF,
	(uint16_t) &PORTG,
	(uint16_t) &PORTH,
	NOT_A_PORT,
	(uint16_t) &PORTJ,
	(uint16_t) &PORTK,
	(uint16_t) &PORTL,
};

const uint16_t PROGMEM port_to_input_PGM[] = {
	NOT_A_PIN,
	(uint16_t) &PINA,
	(uint16_t) &PINB,
	(uint16_t) &PINC,
	(uint16_t) &PIND,
	(uint16_t) &PINE,
	(uint16_t) &PINF,
	(uint16_t) &PING,
	(uint16_t) &PINH,
	NOT_A_PIN,
	(uint16_t) &PINJ,
	(uint16_t) &PINK,
	(uint16_t) &PINL,
};

const uint8_t PROGMEM relay_num_to_digital_pin[] = {
	RELAY1	,
	RELAY2	,
	RELAY3	,
	RELAY4	,
	RELAY5	,
	RELAY6	,
	RELAY7	,
	RELAY8	, 
	RELAY9	,
	RELAY10	,
	RELAY11	,
	RELAY12	,
	RELAY13	,
	RELAY14	,
	RELAY15	,
	RELAY16	,
	RELAY17	,
	RELAY18	,
	RELAY19	,
	RELAY20	,
	RELAY21	,
};

